Revit 2026 API

# ColorFillSchemeCanRemoveEntry Method

---

Checks whether entry can be removed from the scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanRemoveEntry(
	ColorFillSchemeEntry entry
)
```
```vb
Public Function CanRemoveEntry (
	entry As ColorFillSchemeEntry
) As Boolean
```
```cpp
public:
bool CanRemoveEntry(
	ColorFillSchemeEntry^ entry
)
```
```fsharp
member CanRemoveEntry :
        entry : ColorFillSchemeEntry -> bool
```

#### Parameters

entry ColorFillSchemeEntry
     The entry to remove.

#### Return Value

Boolean Returns true if entry can be removed from the scheme, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

An entry cannot be removed if it is in use or does not exist in the scheme.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace